<%@ page contentType="text/html;charset=utf-8" language="java"%>
<html>
<head>
    <style>
        <%@include file="/WEB-INF/css/style.css"%>
    </style>
    <title>/module08/index</title>
</head>
<body>
<h1>kia cerato</h1>
<div class="kia">
    <img class="photo" src="kia.jpg"  alt="kia cerato"/>
</div>
<h2>Общая информация</h2>
<ul>
    <li>Страна марки - Южная Корея</li>
    <li>Класс автомобиля - C</li>
    <li>Количество дверей - 4</li>
    <li>Количество мест - 5</li>
    <li>Расположение руля - Левый</li>
</ul>
<h2>Размеры</h2>
<ul>
    <li>Длина - 4505 мм</li>
    <li>Ширина - 1775 мм</li>
    <li>Высота - 1480 мм</li>
    <li>Колёсная база - 2650 мм</li>
    <li>Клиренс - 160 мм</li>
    <li>Размер колёс - 185/65/R15, 205/55/R16</li>
</ul>
<h2>Объём и масса</h2>
<ul>
    <li>Объем багажника мин/макс - 460 л</li>
    <li>Объём топливного бака - 53 л</li>
    <li>Снаряженная масса - 1324 кг</li>
    <li>Полная масса - 1760 кг</li>
</ul>
<h2>Трансмиссия</h2>
<ul>
    <li>Коробка передач - Механика</li>
    <li>Количество передач - 5</li>
    <li>Тип привода - передний</li>
</ul>

<h3>Варианты исполнения</h3>
<div id="complectations">
    <ol>
        <li>Бензин, 1.6 л, G4FC, 122 л.с., МКПП, передний привод</li><br>
        <li>Бензин, 1.6 л, G4FC, 122 л.с., АКПП, передний привод</li><br>
        <li>Бензин, 2.0 л, G4GC, 143 л.с., МКПП, передний привод</li><br>
        <li>Бензин, 2.0 л, G4GC, 143 л.с., АКПП, передний привод</li>
    </ol>
</div>
<hr>
<a href="/module08/author">Автор работы</a>
</body>
</html>